<?php
 /*文件名称: onload_agreement.php
  *文件作用: 返回用户协议
  */
  	$data = "用户协议
一、特别提示
在此特别提醒您(用户)在使用“大学最后一公里”小程序之前，请认真阅读本《大学最后一公里用户服务协议》(以下简称“协议”)，确保您充分理解本协议中各条款，特别涉及免除或者限制本方责任的免责条款，对您的权利限制的条款及法律适用、争议解决方式的条款。请您审慎阅读并选择接受或不接受本协议。除非您接受本协议所有条款，否则您无权认证、登录或使用本协议所涉服务。您的认证、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束，不得以任何理由包括但不限于未能认真阅读本协议等作为纠纷抗辩理由。
本《协议》是一份同态文档，更新后的协议条款一旦公布即代替原来的协议条款，不再另行个别通知。您可以在“大学最后一公里”小程序主页查看用户须知查阅最新版协议条款。在修改《协议》条款后，如果您不接受修改后的条款，请立即停止使用此小程序和其提供的相关服务，您继续使用本小程序和服务将被视为已接受了修改后的协议。
二、服务提供
1、您理解，本方是中立的软件系统提供者，微信小程序服务账号等服务是由腾讯独立运营并独立承担责任的服务平台。因您使用微信小程序服务或您在使用微信小程序服务过程中遭受的损失，请您和腾讯协商解决。对上述纠纷，本方有权进行协调，但本方并不保证协调取得实际效果，您不应要求本方进行赔偿或补偿。
2、本协议项下服务是指本方小程序调用的微信提供API接口，通过该接口，您可以通过本方系统直接使用本方开发的微信小程序软件及相关服务，如您已经注册了微信账号，在使用此小程序时通过授权登陆后可以使用本方开发的微信小程序及相关服务。通过这种服务将实现您在微信用户信息、操作同步显示，从而实现信息分享同步。
三、信息使用与授权
1、您确认，基于您使用的微信小程序服务（包括但不限于服务的认证、审核、使用、账号安全）由腾讯提供，除本协议外，如腾讯就微信小程序服务使用事宜另行制定规范或规则的，如《腾讯服务协议》、《腾讯微信软件许可及服务协议》、《微信公众平台服务协议》、《微信小程序平台服务条款》、《微信公众平台认证服务协议》等，您应遵守前述规范或规则。
2、您授权本方将您的“大学最后一公里”账户及您上传或提交的注册和使用微信小程序相关信息等传递给腾讯，用于腾讯为您提供服务。页面提示上可能会展示具体授权对象、授权字段名称、范围等，授权字段通过加密通道传递给腾讯。
3、您应按照腾讯的要求和流程提交真实准确的相关资料，并通过腾讯或其委托的第三方审核。如腾讯公司发现您的注册信息不真实或不准确的，腾讯公司有权暂停或终止向您提供相关服务,由此产生的一切法律责任由您自行承担。
4、本方有权查阅您的认证、交易数据及交易行为，如发现可能存在违反法律法规、本协议或本方相关规则的情形或其他任何问题，本方有权直接做出其认为合理的处理，包括但不限于删除相关信息，停止被协议项下的服务内容等。前述约定不代表本方应对您的行为承担任何连带责任，您应对此产生的法律责任独立负责。
5、您同意，您使用本服务产生的相关数据，包括但不限于您在提交、操作中形成的数据及各类交易数据、您在使用微信小程序服务所形成的数据，在不损害您的合法权益的前提下，本方有权进行收集、使用。
四、权利与义务
	1、本方按照用户订单的相关信息对用户快递包裹进行派送，现阶段暂且派送至宿舍楼下由本方快递员通知用户下楼领取，领取时用户须出示取货码等相关信息，相关费用请参照价格及计费方法。
	2、本方负责及时全面查询业务，负责跟踪用户每一份快递包裹的整个流程。
	3、如果快递在本方运送过程中受损，本方有义务协助用户追查相关责任人，如有明确信息证明快递受损原因在于本方，本方将依照用户协议进行赔偿，其他情况本方不承担相关责任。
	4、用户有义务按照配合本方依据相关规定进行订单的下订。
	5、用户有权利对自己所下订单，自己账户信息进行相关信息的查询。
	6、用户在下单后订单有问题或快递包裹出现问题请在下单日（含）起三日内尽快与平台客服联系，超出时限后平台概不负责。
	7、用户在工作人员送达包裹后（包裹处于已送达未签收状态），如一日内未点击签收按钮，则平台将自动签收相关订单。
五、价格及计费方法
	本平台将快递包裹依据体积(cm3)和重量(kg)分为三类：小件，中件，大件。
	小件：体积25*10*10cm3且0.5kg以下，例如:普通水杯，鼠标，普通书籍等。单件1张共享券可送至宿舍楼下。
	中件：体积35*20*15cm3且1.5kg以下，例如：鞋子，书包等。单件2张共享券可送至宿舍楼下。
	除中件和小件的尺寸规格外，其他尺寸规格均为大件，大件单件4张共享券可送至宿舍楼下。如果由于快递包裹体积过大或者重量过重（50*50*50cm3或8kg以上）可能造成的延误本方有权利和用户协商更改原定送货时间，协商不成将取消订单并返回用户所花费用，由于快递包裹自身原因造成的延误和损失由用户承担。
	本方对快件所属分类和其运送价格具有更改权利和最终解释权。
六、责任划分与赔偿
本小程序研发运行的目的是进行代取快递服务，因此用户在使用本平台前应明细以下事项：
1、价值在1000元及以上的快递包裹本平台概不受理。；
2、内含玻璃制品、瓷器、陶器等易碎物品和花草鸟鱼等动植物的快递包裹本平台概不受理；
3、其他易造成物损的物品本平台概不受理。
4、您有责任核实物品是否符合本平台运送相关规定并承担误下订单的责任，订单下单后，本平台默认为您已核实相关规定。
5、在取货前若发现快递包裹发生损毁，本平台快递员将会与您取得联系征得您的意见，并有权退单。若接单后由于本平台的失误使快递包裹发生损毁，根据《中华人民共和国》邮政法第四十七条相关条款，将依照下列规定赔偿：1、保价的给据邮件丢失或者全部损毁的，按照保价额赔偿；部分损毁或者内件短少的，按照保价额与邮件全部价值的比例对邮件的实际损失予以赔偿；2、未保价的给据邮件丢失、损毁或者内件短少的，按照实际损失赔偿，但最高赔偿额不超过所收取资费的三倍。（保价金额为您在快递公司的保价金额）
6、本平台将会收集用户的姓名、手机号、取货信息图像及货号、所住楼宇号及房间号、校园卡图像（认证用户）等信息用于代取快递及送货服务，本平台声明关于用户的个人隐私信息除经用户同意外将不会以任何理由透露给第三方，亦不允许任何第三方以任何手段收集、编辑、出售或者无偿传播用户的个人信息。任何用户如从事上述活动，一经发现，本平台有权立即终止与该用户的服务协议，查封其账号并追究其法律责任。
七、共享券
（一）本方所收取的快件费用皆为“共享券”形式，共享券可以通过充值，兑换等方式获得，除“大学最后一公里”经营终止的情况外，本方不提供任何虚拟货币退还或逆向兑换服务，当本方经营终止时，因现金充值方式而获取的共享券我方将依靠用户提供的相关支付凭证退换相应数额给用户,其他方式获取的共享券不具备退还资格。
共享券的使用范围：
1、“大学最后一公里”快递业务。
2、其他由本方拓展纳入信用体系的服务。
（二）在使用充值方式时，用户务必仔细确认自己的账号并仔细选择相关操作选项。若因为用户自身操作不当或不了解充值计费方式等因素造成充错账号、错选充值金额等情形而损害自身权益的，本方将不会作任何补偿或赔偿；若用户以非法的方式，或使用非本方所指定的充值方式进行充值，本方不保证该充值顺利或者正确完成；若因此造成用户权益受损时，本方不会作任何补偿或赔偿，本方同时保留随时终止该用户账号资格及使用各项充值服务的权利。
（三）用户使用各种充值方式进行充值后，应保留充值凭证以作为今后发生问题核对依据凭证（用户就充值服务投诉，未有有效凭证佐证的，本方将不会作出任何补偿或赔偿）。
若因充值方式原因造成用户充值失实并经查证属实的，本方将根据用户充值情况作出变动措施：
（a）因充值方式原因，造成系统充值额小于用户实际充值额的，本方予以补其差额；
（b）因充值方式原因，造成系统充值额大于用户实际充值额的，本方有权追回差额。
（四）免责声明：发生下列情况时，本方免于承担任何法律责任：
（a）用户因使用第三方支付渠道充值过程中发生的相关争议；
（b）由于用户将密码告知他人导致的用户财产损失；
（c）因用户个人故意或重大过失，或本协议之外的第三方所造成的用户财产损失；
（d）由不可抗力及不可预见的情势导致的各种情况和纠纷；不可抗力和不可预见情势包括但不限于：黑客攻击、政府管制、病毒侵袭。

八、服务终止
（一）在下列情况下，本平台有权终止向用户提供服务:
1、在用户违反本服务协议相关规定时，本平台有权终止向该用户提供服务。如该用户再一次直接或间接或以他人名义使用本小程序提供的服务时，一经发现，相关责任由用户直接承担并且本平台有权直接单方面终止向该用户提供服务;
2、如本平台通过用户提供的信息与用户联系时，发现用户在认证时填写的联系方式已不存在或无法接通，本平台以其它联系方式通知用户更改，而用户在三个工作日内仍未能提供新的联系方式，本平台有权终止向该用户提供服务;
3、用户不得通过程序或人工方式进行刷量或作弊，若发现用户有作弊行为，本平台将立即终止服务，并有权扣留账户内金额;
4、一旦本平台发现用户提供的数据或信息中含有虚假内容，本平台有权随时终止向该用户提供服务;
5、本服务条款终止或更新时，用户明示不愿接受新的服务条款;
6、其它本平台认为需终止服务的情况。
（二）服务终止后，本平台没有义务为用户保留原账号中或与之相关的任何信息，或转发任何未曾阅读或发送的信息给用户或第三方。
九、其他
0、本方对大学最后一公里所组织的所有活动具有最终解释权。
1、大学最后一公里郑重提醒用户注意本协议中免除本方责任和限制用户权利的条款，请用户仔细阅读，自主考虑风险。未成年人应在法定监护人的陪同下阅读本协议。
2、本协议的效力、解释及纠纷的解决，适用于中华人民共和国法律。若用户和本平台之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，用户同意将纠纷或争议提交本方住所地有管辖权的人民法院管辖。
3、本协议的任何条款无论因何种原因无效或不具可执行性，其余条款仍有效，对双方具有约束力。
4、本协议最终解释权归本方所有，并且保留一切解释和修改的权力。
5、本协议从2019年3月20日起适用。
";
	echo json_encode($data);




  ?>